[
  {
    "title": "Library Management System in Python",
    "description": "A simple command prompt based LMS system in python",
    "tags": ["Python", "pip", "command prompt"],
    "link": "https://github.com/shivrajanand/Library-Management-System-in-Python"

  },
  {
    "title": "Responsive Chatbot in Python",
    "description": "A voice enable chatbot that responds to predefined user queries",
    "tags": ["Python", "Pyttsx3", "SpeechRecognition"],
    "link": "https://mega.nz/folder/aAAjHKgL#H0iNwcNrkr61VoBdipx9zw"
  },
  {
    "title": "Machine Learning Analysis on Housing Sales Dataset",
    "description": "The project is focused on analyzing a dataset to predict house sale prices based on different attributes, particularly using regression models and evaluating their effectiveness. Download exe and readme of my project from link",
    "tags": ["Python", "Pandas", "Matplotlib"],
    "link": "https://www.kaggle.com/code/shivrajanandai/housing-data-set-regression-modelling"
  },
  {
    "title": "Result Analysis and Progress Report Generator",
    "description": "This project involves analyzing students' academic progress by generating personalized progress reports based on their marks and CGPA scores over multiple semesters.",
    "tags": ["Python", "Pandas", "Matplotlib"],
    "link": "https://github.com/shivrajanand/Result-Analysis-Progress-Report-Generator"
  },

  {
    "title": "Report on AVATAR: Java Python Program Translation",
    "description": "Exploring AVATAR, a parallel corpus for Java-Python program translation, leveraging machine learning models.",
    "tags": ["Research", "Report", "Python", "Java", "BERT"],
    "link": "https://shivrajanand.github.io/blog_pages/avatar.html"
  },

  {
    "title": "Machine Learning Introductory Course",
    "description": "An introductory course on ML based on my notes from my training from Internshala made in static website form for faster loading and easy access",
    "tags": ["Tutorial", "Machine Learning", "Python", "Pandas", "Numpy", "Matplotlib"],
    "link": "https://shivrajanand.github.io/blog_pages/MLNOTES/Chapter1.html"
  },
  {
    "title": "Development of an Autocorrect System Using Language and Channel Models",
    "description": "The project focuses on the development of an autocorrect model using natural language processing (NLP) techniques. The system is built using Probabilitics Models rather than training deep neural networks. This is my btech 7th semester minor project",
    "tags": ["NLP", "Python", "Spacy", "Collections", "Natural Language Processing"],
    "link": "https://shivrajanand.github.io/blog_pages/btechminor.html"
  },
  {
    "title": "Next Word Recommender System using Probabilistic Approach",
    "description": "A next words recommender system i built during my NLP training. The system uses a probabilistic approach to predict the next word in a sentence.",
    "tags": ["NLP", "Python", "Spacy", "Collections", "Natural Language Processing"],
    "link": "https://shivrajanand.github.io/blog_pages/NextWordRecommenderSystem.html"
  },
  {
    "title": "Smart Task Manager",
    "description": "A desktop-based task management system built with Python and Tkinter. It includes features like add/edit/delete tasks, sorting, filtering, search, progress tracking, dark/light mode, and a polished UI. Ideal for productivity enthusiasts and learners exploring Python GUI development.",
    "tags": ["Python", "Tkinter", "Desktop App", "Productivity", "Task Manager"],
    "link": "https://github.com/shivrajanand/Smart-Task-Manager"
  },
  {
    "title": "Random Password Generator Web App",
    "description": "A random password generator web app built using html, css and js with a unique logic. I have used collatz conjecture, one of the unsolved problems in mathematics and leveraged its properties to generate controlled pseudorandom numbers which is then converted to a password",
    "tags": ["HTML", "CSS", "JS", "Github", "Vercel", "Collatz Conjecture"],
    "link": "https://web-projects-three-lovat.vercel.app/RandomPasswordGenerator/index.html"
  },
  {
    "title": "Personal Portfolio",
    "description": "My own portfolio which I created for my skills and project showcasing. It includes a blog section, projects section and certificate display section. What unique I did is I leverged the power of ChatGPT to build this version of my portfolio in just 2 days which honestly could have taken like 2 to 3 weeks if every piece of code was to be written by myself. Also some design and color selection was guided by chatGPT becuase my choice in colors is always dull due to my personal preferences. Overall this project is not only a showcase of my frontend skills but also that I am an intermediate expert in ChatGPT Prompt Engineering.",
    "tags": ["HTML", "CSS", "JS", "Github", "ChatGPT", "Prompt Engineering"],
    "link": "https://shivrajanand.github.io"
  },
  {
    "title": "GATE College Finder'25",
    "description": "This web app is a one-stop tool that lets you input your GATE score, pg course, category to find colleges you’re eligible for—based on data from the official CCMT Counselling 2024.",
    "tags": ["Python3", "Streamlit", "GATE24", "CCMT data", "Pandas", "Web App"],
    "link": "https://gatecollegefinder2025.streamlit.app/"
  }
  
]
